12/data/attachments/ede58126b589f764.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_679213f0-1ef1-4869-9c54-b1670eafb22c</nif:username>
            <nif:pageInfo>
                <nif:page>1</nif:page>
                <nif:size>5</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>